# CLI tools
brew "bat"
brew "claude-squad"
brew "delta"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "starship"
brew "tailscale"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"

# Languages & runtimes
brew "go"
brew "rust"
brew "oven-sh/bun/bun"

# Dev services
brew "ollama"
brew "redis"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"

# Oh My Zsh plugins (install manually)
# git clone https://github.com/zsh-users/zsh-autosuggestions ${ZSH_CUSTOM:-~/.oh-my-zsh/custom}/plugins/zsh-autosuggestions
# git clone https://github.com/zsh-users/zsh-syntax-highlighting ${ZSH_CUSTOM:-~/.oh-my-zsh/custom}/plugins/zsh-syntax-highlighting
