# dotfiles/Brewfile

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'    # 맥에 기본 설치된 툴을 대체하기 위한 Tap (e.g. nano 등)
tap 'homebrew/services'

# 중요! 이 줄이 없으면, ~/Applications에 설치하므로 꼭 넣어야 한다.
cask_args appdir: '/Applications'

# Binaries/Libraries
brew 'zsh'
brew 'git'

brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'coreutils'
brew 'cscope'
brew 'fasd'
brew 'freetype'
brew 'fzf'
brew 'gdbm'
brew 'gettext'
brew 'git-lfs'
brew 'icu4c'
brew 'imagemagick'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libpng'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libyaml'
brew 'luajit'
brew 'mackup'
brew 'macvim'
brew 'msgpack'
brew 'mysql'
brew 'neofetch'
brew 'neovim'
brew 'nginx'
brew 'node@6'
brew 'node@8'
brew 'oniguruma'
brew 'openssl'
brew 'openssl@1.1'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'python'
brew 'python@2'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'screenresolution'
brew 'sphinx-doc'
brew 'sqlite'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'unibilium'
brew 'vim'
brew 'watchman'
brew 'xz'
brew 'yarn'
brew 'zsh-completions'
# ...

# Applications
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'
cask 'mounty'
cask 'react-native-debugger'
# ...
